[{"id":1,"title":"Introduction to React JS","created":"2023-01-02 10:44","source":"introduction-to-react-js","description":"React is a popular JavaScript library for building user interfaces. It was developed by Facebook, and is often used for building single-page applications and mobile applications.","tags":["react"]},{"id":2,"title":"Components in React JS","created":"2023-01-02 10:44","source":"components-in-reactjs","description":"In React, a component is a piece of code that represents a part of a user interface. Components are the building blocks of a React application, and can be reused throughout the application.","tags":["react"]},{"id":3,"title":"State in a React class component","created":"2023-01-02 10:44","source":"state-in-a-react-class-component","description":"In a class-based React component, the state is an object that stores the component's internal data and determines the component's behavior. The state object can be updated using the setState method, which causes the component to re-render and update the UI to reflect the new state.","tags":["react","state"]},{"id":4,"title":"The useState() hook in React JS","created":"2023-01-02 10:44","source":"use-state-hook","description":"The useState hook is a feature in React that allows you to add state to functional components. Prior to the introduction of hooks, state could only be used in class-based components.","tags":["react","state","hook"]},{"id":5,"title":"The useEffect() hook in React JS","created":"2023-01-02 10:44","source":"the-use-effect-hook","description":"The useEffect hook is a feature in React that allows you to perform side effects in functional components. Side effects are operations that have an effect on something outside the component itself, such as making an API call or updating the DOM.","tags":["react","hook"]},{"id":6,"title":"Introduction to Redux state management technique","created":"2023-01-02 10:44","source":"introduction-to-redux","description":"Redux is a predictable state management library for JavaScript applications. It is often used with libraries such as React or Angular for building user interfaces.","tags":["redux"]},{"id":7,"title":"How to reverse an array in JavaScript?","created":"2023-01-02 10:44","source":"how-to-reverse-an-array-in-javascript","description":"The reverse method modifies the original array in place and returns a reference to the modified array. It is a simple and efficient way to reverse an array, but it is not suitable for all cases because it mutates the original array.","tags":["javascript","array","reverse"]},{"title":"How to create a 'slug' in JavaScript","description":"Slug is a term used for a string that can be used as a URL. Generally, a blog post's title will be converted to a slug, so that the url is user and SEO friendly.","source":"how-to-create-a-slug-in-javascript","created":"1/5/2023 7:38:56 AM","tags":[],"id":8},{"title":"The finally block in Java","source":"the-finally-block","created":"1/5/2023 4:50:29 PM","tags":[],"id":9,"description":"In Java, the finally block is a block of code that is used to ensure that a certain piece of code is executed after a try block, whether or not an exception is thrown.\n\n"},{"title":"Using multiple catches with one try block in Java","description":"In Java, you can use multiple catch blocks with a single try block to handle different types of exceptions. This can be useful if you want to handle different exceptions differently, or if you want to handle the same exception differently depending on the circumstances.\n\n","source":"using-multiple-catches-with-one-try-block","created":"1/5/2023 9:08:32 PM","tags":[],"id":10},{"title":"JSP Elements","description":"In Java Server Pages (JSP), an element is a piece of code that is used to insert content or execute certain actions in a JSP page. There are several types of elements that you can use in a JSP page, including:\n","source":"jsp-elements","created":"1/5/2023 9:17:10 PM","tags":[],"id":11},{"title":"Enable CORS in a JAX-RS Project","description":"Cross-Origin Resource Sharing (CORS) is a security feature that restricts web pages from making requests to a different domain than the one that served the web page. If you are developing a JAX-RS project and want to enable CORS, there are a few different approaches you can take.\n\n","source":"enable-cors-in-a-jax-rs-project","created":"1/5/2023 9:22:45 PM","tags":[],"id":12}]